Revit 2027 API
Truss.SetProfile Method
Add or modify the profile of a truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetProfile(
	CurveArray topChords,
	CurveArray bottomChords
)
Public Sub SetProfile (
	topChords As CurveArray,
	bottomChords As CurveArray
)
public:
void SetProfile(
	CurveArray^ topChords,
	CurveArray^ bottomChords
)
member SetProfile :
        topChords : CurveArray *
        bottomChords : CurveArray -> unit
Parameters
topChords CurveArray
The curves serving as top chords of the truss.
bottomChords CurveArray
The curves serving as bottom chords of the truss.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace